In [ ]:
# Play with Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Create series

df = pd.Series([1, 3,5, 'a',np.nan])

In [4]:
df #single dimension df

0      1
1      3
2      5
3      a
4    NaN
dtype: object

In [10]:
# create daterange

dates =pd.date_range("20240214",periods =6)
dates

DatetimeIndex(['2024-02-14', '2024-02-15', '2024-02-16', '2024-02-17',
               '2024-02-18', '2024-02-19'],
              dtype='datetime64[ns]', freq='D')

In [9]:
pd.Series(np.random.randn(5))

0    0.253880
1    1.644606
2    0.104577
3   -0.344404
4    0.162980
dtype: float64

In [13]:
pd.Series(np.random.randint(6), dates)

2024-02-14    4
2024-02-15    4
2024-02-16    4
2024-02-17    4
2024-02-18    4
2024-02-19    4
Freq: D, dtype: int64

In [14]:
#Create dataframe

In [22]:
df = pd.DataFrame(np.random.randn(6,4),index =dates, columns=list("ABCD"))
df

                   A         B         C         D
2024-02-14 -1.370468  0.017223  1.658180  0.055171
2024-02-15 -2.608567 -0.619600 -0.643549  0.711507
2024-02-16  0.356010  0.203053  0.016823  0.786485
2024-02-17  0.181107  0.902369 -0.026381  1.270902
2024-02-18 -0.513312  0.247052 -0.616978  0.031554
2024-02-19 -0.374412  0.313311 -0.055536  0.451817

In [53]:
pd.DataFrame(np.random.randn(4,4),index=['AA','BB','CC','DD'],columns =['apple','banana','cat','dog'])

       apple    banana       cat       dog
AA  0.404638 -1.163203  0.959753 -0.370383
BB  0.548836  0.930397 -1.021073  0.701022
CC -0.378180  0.922999 -0.144828 -2.077193
DD -1.211971  0.199723  0.215785 -0.513871

In [33]:
#df,series from list

l1 = ["Spark",20000, "30days"]
l2= ["pandas",22000, "20days"]
pd.Series(l1,l2)

pandas     Spark
22000      20000
20days    30days
dtype: object

In [54]:
l = [l1,l2]
df = pd.DataFrame(l)
df

        0      1       2
0   Spark  20000  30days
1  pandas  22000  20days

In [38]:
#pd.DataFrame(l1,l2) # took as index - wrong

             0
pandas   Spark
22000    20000
20days  30days

In [55]:
index = ['A','B']
columns = ['course','amt','days']
df = pd.DataFrame(l, index = index, columns = columns)
df

   course    amt    days
A   Spark  20000  30days
B  pandas  22000  20days

In [42]:
# Set custom types to DataFrame
types = {'course':str,'amt':int,'days':str}
df = df.astype(types)

In [43]:
df.dtypes

course    object
amt        int32
days      object
dtype: object

In [44]:
# from dict

dic = {
    'course':['spark','pandas'],
    'amt':[20000,10000],
    'days':['10days','15days']
}
pd.DataFrame(dic)

   course    amt    days
0   spark  20000  10days
1  pandas  10000  15days

In [47]:
#Create df from series

course=pd.Series(['spark','pandas'])
amt=pd.Series([20000,10000])
days=pd.Series(['10days','15days']) 
df =pd.concat([course,amt,days],axis =1)
df

        0      1       2
0   spark  20000  10days
1  pandas  10000  15days

In [58]:
#Creating DataFrame using zip() function

tup_list = list(zip(course, amt, days))
df =pd.DataFrame(tup_list, columns = ['course','amt','duration'])
df.head(1)

  course    amt duration
0  spark  20000   10days

# Select Rows by Index (Position/Label)
Use Pandas DataFrame.iloc[] & DataFrame.loc[] to select rows by integer Index and by row indices respectively. iloc[] attribute can accept single index, multiple indexes from the list, indexes by a range, and many more. loc[] operator is explicitly used with labels that can accept single index labels, multiple index labels from the list, indexes by a range (between two index labels), and many more. When using iloc[] or loc[] with an index that doesn’t exist it returns an error.

In [64]:
# Select Rows by Integer Index
df.iloc[1:]

   course    amt duration
1  pandas  10000   15days

In [67]:
df.iloc[1]

course      pandas
amt          10000
duration    15days
Name: 1, dtype: object

In [66]:
df.loc[1:]

   course    amt duration
1  pandas  10000   15days

In [70]:
df.loc[0]

course       spark
amt          20000
duration    10days
Name: 0, dtype: object

In [97]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies,index=index_labels)
print("Create DataFrame:\n", df)

Create DataFrame:
     Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   Pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [72]:
print(df.iloc[-1:])

   Courses    Fee Duration  Discount
r7    Java  22000   55days      2000

In [73]:
print(df.iloc[::2])

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3  Hadoop  26000   35days      1500
r5  Pandas  24000      NaN      2500
r7    Java  22000   55days      2000

In [74]:
df1 = df.loc['r2']
print("After selecting a row by index label:\n", df1)

After selecting a row by index label:
 Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [75]:
# Select Alternate Rows with in Index Labels
print(df.loc['r1':'r5':2])

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3  Hadoop  26000   35days      1500
r5  Pandas  24000      NaN      2500

In [77]:
# Selecet column name based on value

df[df['Fee']>25000]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500

How can I reset the index after selecting rows by index?
You can use the reset_index() method to reset the index of a DataFrame. For example, rows = df.loc[index_label].reset_index(drop=True)

In [86]:
df = df.loc[df['Courses']!='Java'].reset_index(drop=True)

In [87]:
df

   Courses    Fee Duration  Discount
0    Spark  20000   30days      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1500
3   Python  22000   40days      1200
4   Pandas  24000      NaN      2500
5   Oracle  21000     None      2100

In [88]:
# Example 2: Using loc[] to take column slices
df2 = df.loc[:,'Fee':'Discount'] # Select columns between two columns
df2

     Fee Duration  Discount
0  20000   30days      1000
1  25000   40days      2300
2  26000   35days      1500
3  22000   40days      1200
4  24000      NaN      2500
5  21000     None      2100

In [92]:
df2 = df.loc[:,:'Duration']  # Select columns by range
df2

   Courses    Fee Duration
0    Spark  20000   30days
1  PySpark  25000   40days
2   Hadoop  26000   35days
3   Python  22000   40days
4   Pandas  24000      NaN
5   Oracle  21000     None

In [93]:
df2 = df.loc[:,::2]
df2

   Courses Duration
0    Spark   30days
1  PySpark   40days
2   Hadoop   35days
3   Python   40days
4   Pandas      NaN
5   Oracle     None

pandas.DataFrame.filter() – To filter rows by index and columns by name.
pandas.DataFrame.loc[] – To select rows by indices label and column by name.
pandas.DataFrame.iloc[] – To select rows by index and column by position.
pandas.DataFrame.apply() – To custom select using lambda function.

In [90]:
# Example 3: Using iloc[] to select column by Index
df2 = df.iloc[:,[1,3]] # Select columns by Index

In [91]:
df2

     Fee  Discount
0  20000      1000
1  25000      2300
2  26000      1500
3  22000      1200
4  24000      2500
5  21000      2100

In [95]:
# Query Rows using DataFrame.query()
df2=df.query("Courses == 'Spark'")
df2

  Courses    Fee Duration  Discount
0   Spark  20000   30days      1000

In [99]:
df.query("`Fee` >= 23000 and `Fee` <= 24000")

   Courses    Fee Duration  Discount
r5  Pandas  24000      NaN      2500

In [ ]:
# Query() method syntax
# DataFrame.query(expr, inplace=False, **kwargs)
# expr – expression takes conditions to query rows
# inplace – Defaults to False. When it is set to True, it updates the existing DataFrame, and query() method returns None.
# **kwargs –  Keyword arguments that work with eval()

In [100]:
# Query Rows by using Python variable
value='Spark'
df2 = df.query("Courses == @value")
print("After filtering the rows based on condition:\n", df2)

After filtering the rows based on condition:
    Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [101]:
# Query Rows by list of values
df2 = df.query("Courses in ('Spark','PySpark')")
print("After filtering the rows based on condition:\n", df2)

After filtering the rows based on condition:
     Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300

In [103]:
# Query Rows not in list of values
values=['Spark','PySpark']
df2 = df.query("Courses not in @values")
print("After filtering the rows based on condition:\n", df2)

After filtering the rows based on condition:
    Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r5  Pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

Query Rows using apply()
pandas.DataFrame.apply() method is used to apply the expression row-by-row and return the rows that match the values.

In [104]:
# By using lambda function
df2 = df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])])
print("After filtering the rows based on condition:\n", df2)

After filtering the rows based on condition:
     Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300

In [105]:
# Other examples you can try to query rows
df[df["Courses"] == 'Spark'] 
df.loc[df['Courses'] == value]
df.loc[df['Courses'] != 'Spark']
df.loc[df['Courses'].isin(values)]
df.loc[~df['Courses'].isin(values)]
df.loc[(df['Discount'] >= 1000) & (df['Discount'] <= 2000)]
df.loc[(df['Discount'] >= 1200) & (df['Fee'] >= 23000 )]

# Select based on value contains
print(df[df['Courses'].str.contains("Spark")])

# Select after converting values
print(df[df['Courses'].str.lower().str.contains("spark")])

# Select startswith
print(df[df['Courses'].str.startswith("P")])

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r4   Python  22000   40days      1200
r5   Pandas  24000      NaN      2500

In [107]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   Pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [106]:
# Below are some quick examples 

# Using loc[]. Get cell value by name & index
print(df.loc['r4']['Duration'])
print(df.loc['r4'][2])

# Using iloc[]. Get cell value by index & name
print(df.iloc[3]['Duration'])
print(df.iloc[3,2])


# Using DataFrame.at[]
print(df.at['r4','Duration'])
print(df.at[df.index[3],'Duration'])

# Using DataFrame.iat[]
print(df.iat[3,2])

# Get a cell value
print(df["Duration"].values[3])

# Get cell value from last row
print(df.iloc[-1,2])
print(df.iloc[-1]['Duration'])
print(df.at[df.index[-1],'Duration'])

40days
40days
40days
40days
40days
40days
40days
40days
55days
55days
55days

# Add a new column to the existing DataFrame
In pandas you can add/append a new column to the existing DataFrame using DataFrame.insert() method,
this method updates the existing DataFrame with a new column. 
DataFrame.assign() is also used to insert a new column however,
this method returns a new Dataframe after adding a new column.

In [114]:
# Create DataFrame
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1000,2300,1000,1200,2500]
          }

df = pd.DataFrame(technologies)
print("Create a DataFrame:\n", df)

Create a DataFrame:
    Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

In [119]:
# Quick Examples of Add Column to DataFrame

# Below are quick examples

# Add new column to the DataFrame
tutors = ['William', 'Henry', 'Michael', 'John', 'Messi']
df2 = df.assign(TutorsAssigned=tutors)

# Add a multiple columns to the DataFrame
MNCCompanies = ['TATA','HCL','Infosys','Google','Amazon']
df2 =df.assign(MNCComp = MNCCompanies,TutorsAssigned=tutors )

# Derive New Column from Existing Column
df = pd.DataFrame(technologies)
df2=df.assign(Discount_Percent=lambda x: x.Fee * x.Discount / 100)

# Add a constant or empty value to the DataFrame.
df = pd.DataFrame(technologies)
df2=df.assign(A=None,B=0,C="")

# Add New column to the existing DataFrame
df = pd.DataFrame(technologies)
df["MNCCompanies"] = MNCCompanies

# Add new column at the specific position
df = pd.DataFrame(technologies)
df.insert(0,'Tutors', tutors )

# Add new column by mapping to the existing column
df = pd.DataFrame(technologies)
tutors = {"Spark":"William", "PySpark":"Henry", "Hadoop":"Michael","Python":"John", "Pandas":"Messi"}
df['Tutors'] = df['Courses'].map(tutors)
print(df)

   Courses    Fee  Discount   Tutors
0    Spark  22000      1000  William
1  PySpark  25000      2300    Henry
2   Hadoop  23000      1000  Michael
3   Python  24000      1200     John
4   Pandas  26000      2500    Messi

In [120]:
df2

   Courses    Fee  Discount     A  B C
0    Spark  22000      1000  None  0
1  PySpark  25000      2300  None  0
2   Hadoop  23000      1000  None  0
3   Python  24000      1200  None  0
4   Pandas  26000      2500  None  0

In [121]:
# Add a multiple columns to the DataFrame
MNCCompanies = ['TATA','HCL','Infosys','Google','Amazon']
df2 =df.assign(MNCComp = MNCCompanies,TutorsAssigned=tutors )

In [122]:
df2

   Courses    Fee  Discount   Tutors  MNCComp TutorsAssigned
0    Spark  22000      1000  William     TATA          Spark
1  PySpark  25000      2300    Henry      HCL        PySpark
2   Hadoop  23000      1000  Michael  Infosys         Hadoop
3   Python  24000      1200     John   Google         Python
4   Pandas  26000      2500    Messi   Amazon         Pandas

In [123]:
# Derive New Column from Existing Column
df = pd.DataFrame(technologies)
df2 = df.assign(Discount_Percent=lambda x: x.Fee * x.Discount / 100)
print("Add column to DataFrame:\n", df2)

Add column to DataFrame:
    Courses    Fee  Discount  Discount_Percent
0    Spark  22000      1000          220000.0
1  PySpark  25000      2300          575000.0
2   Hadoop  23000      1000          230000.0
3   Python  24000      1200          288000.0
4   Pandas  26000      2500          650000.0

In [124]:
# Add new column at the specific position
df = pd.DataFrame(technologies)
df.insert(0,'Tutors', tutors )
print("Add column to DataFrame:\n", df)

Add column to DataFrame:
     Tutors  Courses    Fee  Discount
0    Spark    Spark  22000      1000
1  PySpark  PySpark  25000      2300
2   Hadoop   Hadoop  23000      1000
3   Python   Python  24000      1200
4   Pandas   Pandas  26000      2500

In [126]:
df = pd.DataFrame(technologies)
df

   Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

In [127]:
# Add new column by mapping to the existing column
# df = pd.DataFrame(technologies)
tutors = {"Spark":"William", "PySpark":"Henry", "Hadoop":"Michael","Python":"John", "pandas":"Messi"}
df['Tutors'] = df['Courses'].map(tutors)
print("Add column to DataFrame:\n", df)
#Yields below output. Note that it is unable to map pandas as the key in the dictionary is not exactly matched with the value in the Courses column (case sensitive).

Add column to DataFrame:
    Courses    Fee  Discount   Tutors
0    Spark  22000      1000  William
1  PySpark  25000      2300    Henry
2   Hadoop  23000      1000  Michael
3   Python  24000      1200     John
4   Pandas  26000      2500      NaN

In [128]:
#  DataFrame.rename() Syntax
# DataFrame.rename(mapper=None, index=None, columns=None, axis=None, 
#        copy=True, inplace=False, level=None, errors='ignore')

In [129]:
# Alternatively you can write above code using axis
df2=df.rename({'Courses':'Courses_List'}, axis=1)
print(df2)
df2=df.rename({'Courses':'Courses_List'}, axis='columns')
print("---------",df2)

  Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500      NaN
---------   Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500      NaN

In [130]:
# Replace existing DataFrame (inplace). This returns None.
df.rename({'Courses':'Courses_List'}, axis='columns', inplace=True)
print(df.columns)

Index(['Courses_List', 'Fee', 'Discount', 'Tutors'], dtype='object')

In [131]:
# Pandas rename column by index
df.columns.values[2] = "Courses_Duration"
print(df.columns)

Index(['Courses_List', 'Fee', 'Courses_Duration', 'Tutors'], dtype='object')

In [133]:
df2

  Courses_List    Fee  Discount   Tutors
0        Spark  22000      1000  William
1      PySpark  25000      2300    Henry
2       Hadoop  23000      1000  Michael
3       Python  24000      1200     John
4       Pandas  26000      2500      NaN

In [134]:
# Rename All Column Names by adding Suffix or Prefix
# Rename columns with list
column_names = ['Courses_List','Courses_Fee','Courses_Duration','Tutors']
df2.columns = column_names
df2.columns = ['col_'+str(col) for col in df2.columns]
df2.columns

Index(['col_Courses_List', 'col_Courses_Fee', 'col_Courses_Duration',
       'col_Tutors'],
      dtype='object')

In [136]:
# Add prefix to the column names
df2=df.add_prefix('col_')
print(df2.columns)

# Add suffix to the column names
df2=df.add_suffix('_col')
print(df2.columns)

Index(['col_Courses_List', 'col_Fee', 'col_Courses_Duration', 'col_Tutors'], dtype='object')
Index(['Courses_List_col', 'Fee_col', 'Courses_Duration_col', 'Tutors_col'], dtype='object')

In [137]:
# Rename using Lambda function
df2.rename(columns=lambda x: 'col_'+x, inplace=True)

In [138]:
df2

  col_Courses_List_col  col_Fee_col  col_Courses_Duration_col col_Tutors_col
0                Spark        22000                      1000        William
1              PySpark        25000                      2300          Henry
2               Hadoop        23000                      1000        Michael
3               Python        24000                      1200           John
4               Pandas        26000                      2500            NaN

In [139]:
# Change to all lower case
df = pd.DataFrame(technologies)
df2=df.rename(str.lower, axis='columns')
print(df2.columns)

# Change to all upper case
df = pd.DataFrame(technologies)
df2=df.rename(str.upper, axis='columns')
print(df2.columns)

Index(['courses', 'fee', 'discount'], dtype='object')
Index(['COURSES', 'FEE', 'DISCOUNT'], dtype='object')

In [140]:
# Change column name using set_axis()
df.set_axis(['Courses_List', 'Course_Fee', 'Course_Duration'], axis=1, inplace=True)
print(df.columns)

Index(['Courses_List', 'Course_Fee', 'Course_Duration'], dtype='object')

In [141]:
# Change column name using String.replace()
df.columns = df.columns.str.replace("Fee","Courses_Fee")
print(df.columns)

Index(['Courses_List', 'Course_Courses_Fee', 'Course_Duration'], dtype='object')

In [142]:
# Rename all column names
df.columns = df.columns.str.replace("_"," ")
print(df.columns)

Index(['Courses List', 'Course Courses Fee', 'Course Duration'], dtype='object')

In [144]:
# Throw Error when Rename column doesn't exists.
df.rename(columns = {'Courses List':'Courses_List'}, errors = "raise")

# ## Output:
# raise KeyError("{} not found in axis".format(missing_labels))
# KeyError: "['Cour'] not found in axis"

  Courses_List  Course Courses Fee  Course Duration
0        Spark               22000             1000
1      PySpark               25000             2300
2       Hadoop               23000             1000
3       Python               24000             1200
4       Pandas               26000             2500

In [161]:

# Create a DataFrame
import pandas as pd
import numpy as np

technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python"],
    'Fee' :[20000,25000,26000,22000],
    'Duration':['30day','40days',np.nan, None],
    'Discount':[1000,2300,1500,1200]
               }

indexes=['r1','r2','r3','r4']
df = pd.DataFrame(technologies,index=indexes)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:
# #Pandas.DataFrame.drop() Syntax – Drop Rows & Columns

# # Pandas DaraFrame drop() Syntax
# DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inpl

In [146]:
# Delete Rows by Index Labels & axis
df1 = df.drop(labels=['r1','r2'])
df1 = df.drop(labels=['r1','r2'],axis=0)

df1

   Courses    Fee Duration  Discount
r3  Hadoop  26000      NaN      1500
r4  Python  22000     None      1200

In [147]:
# Delete Rows by Index numbers
df = pd.DataFrame(technologies,index=indexes)
df1=df.drop(df.index[[1,3]])
print(df1)

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000      NaN      1500

In [149]:
# Removes First Row
df=df.drop(df.index[0])

# Removes Last Row
df=df.drop(df.index[-1])
df

Empty DataFrame
Columns: [Courses, Fee, Duration, Discount]
Index: []

In [150]:
df = pd.DataFrame(technologies,index=indexes)
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:
# Remove rows when you have default index.
df = pd.DataFrame(technologies)
df1 = df.drop(0)
df3 = df.drop([0, 3])
df4 = df.drop(range(0,2))

In [151]:
df2=df.dropna()
print(df2)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [ ]:
df

In [153]:
df2 = df.drop_duplicates()
df2

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [162]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [163]:
# Quick examples of drop columns

# Drop single column by Name
df2=df.drop(["Fee"], axis = 1)
df2=df.drop(columns=["Fee"], axis = 1)
df2=df.drop(labels=["Fee"], axis = 1)

# Drop single column by Index
df2=df.drop(df.columns[1], axis = 1)

# Updates the DataFrame in place
df.drop(df.columns[1], axis = 1, inplace=True)

df

    Courses Duration  Discount
r1    Spark    30day      1000
r2  PySpark   40days      2300
r3   Hadoop      NaN      1500
r4   Python     None      1200

In [ ]:
# Drop multiple columns
df.drop(["Courses", "Fee"], axis = 1, inplace=True)
df.drop(df.columns[[1,2]], axis = 1, inplace=True)

# Other ways to drop columns
df.drop(df.loc[:, 'Courses':'Fee'].columns, axis = 1, inplace=True)
df.drop(df.iloc[:, 1:2], axis=1, inplace=True)

#Different Ways to Change Data Type in Pandas

Key Points–

Applying the .astype() method to convert data types directly, specifying the desired dtype.
Utilizing the .to_numeric() function to coerce object types into numeric types, with options for handling errors and coercing strings.
Using the infer_objects() method to automatically infer and convert data types.
Employing the as_type() method to convert data types with specific parameters like nullable integers.
Utilizing custom functions or mapping techniques for more complex type conversions

In [167]:
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000      NaN      1500
3   Python  22000     None      1200

In [164]:
print(df2.dtypes)

Courses     object
Duration    object
Discount     int64
dtype: object

In [176]:
# Quick examples of converting data types 

# Example 1: Convert all types to best possible types
df2=df.convert_dtypes()
print(df2.dtypes)

# Example 2: Change All Columns to Same type
df = df.astype(str)
print(df.dtypes)

Courses     string
Fee         string
Duration    string
Discount    string
dtype: object
Courses     object
Fee         object
Duration    object
Discount    object
dtype: object

In [177]:
# Example 3: Change Type For One or Multiple Columns
df = df.astype({"Fee": int, "Discount": float})
print(df.dtypes)

Courses      object
Fee           int32
Duration     object
Discount    float64
dtype: object

In [178]:
# Example 4: Ignore errors
df = df.astype({"Courses": int},errors='ignore')
print(df.dtypes)

Courses      object
Fee           int32
Duration     object
Discount    float64
dtype: object

In [179]:
# Example 5: Converts object types to possible types
df = df.infer_objects()
print(df.dtypes)

Courses      object
Fee           int32
Duration     object
Discount    float64
dtype: object

In [180]:





# Example 6: Converts fee column to numeric type
df['Fee'] = pd.to_numeric(df['Fee'])
print(df.dtypes)

# Example 7: Convert Fee and Discount to numeric types
df[['Fee', 'Discount']] =df [['Fee', 'Discount']].apply(pd.to_numeric)
print(df.dtypes)

Courses      object
Fee           int32
Duration     object
Discount    float64
dtype: object
Courses      object
Fee           int32
Duration     object
Discount    float64
dtype: object

In [181]:
#DataFrame.convert_dtypes() to Convert Data Type in Pandas

# Convert all types to best possible types
df2=df.convert_dtypes()
print(df2.dtypes)

Courses     string
Fee          Int32
Duration    string
Discount     Int64
dtype: object

In [182]:
# By using a loop
for col in ['Fee', 'Discount']:
    df[col] = df[col].astype('float')

# By using apply() & astype() together
df[['Fee', 'Discount']].apply(lambda x: x.astype('float'))

       Fee  Discount
0  20000.0    1000.0
1  25000.0    2300.0
2  26000.0    1500.0
3  22000.0    1200.0

# Pandas Get the Number of Rows

You can get the number of rows in Pandas DataFrame using len(df.index) and df.shape[0] properties. Pandas allow us to get the shape of the DataFrame by counting the number of rows in the DataFrame.

DataFrame.shape property returns the rows and columns, for rows get it from the first index which is zero; like df.shape[0] and for columns count, you can get it from df.shape[1]. Alternatively, to find the number of rows that exist in a DataFrame, you can use DataFrame.count() method, but this is not recommended approach due to performance issues.

In [183]:
# Quick examples of get the number of rows

# Example 1: Get the row count 
# Using len(df.index)
rows_count = len(df.index)

# Example 2: Get count of rows 
# Using len(df.axes[])
rows_count = len(df.axes[0])

# Example 3:Get count of rows 
# Using df.shape[0]
rows_count = df.shape[0]

# Example 4: Get count of rows
# Using count()
rows_count = df.count()[0]
rows_count

4

In [187]:
# Get row count using df.shape[0]
df = pd.DataFrame(technologies)
row_count = df.shape[0]  # Returns number of rows
col_count = df.shape[1]  # Returns number of columns
print(row_count, col_count)

4 4

In [188]:
# Get count of each column
print(df.count())

Courses     4
Fee         4
Duration    2
Discount    4
dtype: int64

In [190]:

# Get count of rows using count()
rows_count = df.count()[0]
rows_count  = df[df.columns[0]].count()
print('Number of Rows count is:', rows_count )

Number of Rows count is: 4

# Pandas Iterate Over Rows with Examples

Like any other data structure, Pandas DataFrame also has a way to iterate (loop through row by row) over rows and access columns/elements of each row. DataFrame provides methods iterrows(), itertuples() to iterate over each Row.

In [191]:
# Iterate all rows using DataFrame.iterrows()
print("After iterating all rows:\n")
for index, row in df.iterrows():
    print (index,row["Fee"], row["Courses"], row["Duration"])

After iterating all rows:

0 20000 Spark 30day
1 25000 PySpark 40days
2 26000 Hadoop nan
3 22000 Python None

In [192]:

# Row contains the column name and data
row = next(df.iterrows())[1]
print("Data For First Row :")
print(row)

Data For First Row :
Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: 0, dtype: object

In [ ]:
# Syntax DataFrame.itertuples()
# DataFrame.itertuples(index=True, name='Pandas')

In [193]:
# Iterate all rows using DataFrame.itertuples()
for row in df.itertuples(index = True):
    print (getattr(row,'Index'),getattr(row, "Fee"), getattr(row, "Courses"))

0 20000 Spark
1 25000 PySpark
2 26000 Hadoop
3 22000 Python

In [194]:
# Another alternate approach by using DataFrame.apply()
print(df.apply(lambda row: str(row["Fee"]) + " " + str(row["Courses"]), axis = 1))

0      20000 Spark
1    25000 PySpark
2     26000 Hadoop
3     22000 Python
dtype: object

In [197]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [195]:
# Using DataFrame.index
for idx in df.index:
     print(df['Fee'][idx], df['Courses'][idx])

20000 Spark
25000 PySpark
26000 Hadoop
22000 Python

In [198]:
# Another alternate approach byusing DataFrame.loc()
for i in range(len(df)) :
    print(df.loc[i, "Fee"], df.loc[i, "Courses"])

20000 Spark
25000 PySpark
26000 Hadoop
22000 Python

In [199]:
# Another alternate approach by using DataFrame.iloc()
for i in range(len(df)) :
    print(df.iloc[i, 0], df.iloc[i, 2])

Spark 30day
PySpark 40days
Hadoop nan
Python None

In [200]:
# Iterate over column by column using DataFrame.items()
for label, content in df.items():
    print(f'label: {label}')
    print(f'content: {content}', sep='\n')

label: Courses
content: 0      Spark
1    PySpark
2     Hadoop
3     Python
Name: Courses, dtype: object
label: Fee
content: 0    20000
1    25000
2    26000
3    22000
Name: Fee, dtype: int64
label: Duration
content: 0     30day
1    40days
2       NaN
3      None
Name: Duration, dtype: object
label: Discount
content: 0    1000
1    2300
2    1500
3    1200
Name: Discount, dtype: int64

In [203]:
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000      NaN      1500
3   Python  22000     None      1200

In [204]:
# Create DataFrame
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print("Create DataFrame:\n", df)

Create DataFrame:
    A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [205]:
# Below are some quick examples

# Example 1: Using Dataframe.apply() to apply function add column
def add_3(x):
    return x+3
df2 = df.apply(add_3)


# Example 2: Using apply function single column
def add_4(x):
    return x+4
df["B"] = df["B"].apply(add_4)


# Example 3: Apply to multiple columns
df[['A','B']] = df[['A','B']].apply(add_3)

In [206]:
df

   A   B  C
0  6  12  7
1  5  11  6
2  8  15  9

In [ ]:

# Example 4: Apply a lambda function to each column
df2 = df.apply(lambda x : x + 10)


# Example 5: Using Dataframe.apply() and lambda function
df["A"] = df["A"].apply(lambda x: x-2)


# Example 6: Using Dataframe.apply() & [] operator
df['A'] = df['A'].apply(np.square)


# Example 7: Using numpy.square() and [] operator
df['A'] = np.square(df['A'])


# Example 8: Apply function NumPy.square() to square the values of two rows 
#'A'and'B
df2 = df.apply(lambda x: np.square(x) if x.name in ['A','B'] else x)

In [207]:
# Example 9: Apply function single column using transform() 
def add_2(x):
    return x+2
df = df.transform(add_2)

# Example 10: Using DataFrame.map() to Single Column
df['A'] = df['A'].map(lambda A: A/2.)

# Example 11: Using DataFrame.assign() and Lambda
df2 = df.assign(B=lambda df: df.B/2)

In [208]:
df2

     A    B   C
0  4.0  7.0   9
1  3.5  6.5   8
2  5.0  8.5  11

# groupby() in pandas

In Pandas, you can use groupby() with the combination of sum(), count(), pivot(), transform(), aggregate(), and many more methods to perform various operations on grouped data.

# Syntax of DataFrame.groupby()
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, 
       sort=True, group_keys=True, squeeze=<no_default>, 
       observed=False, dropna=True)
by – List of column names to group by
axis – Default to 0. It takes 0 or ‘index’, 1 or ‘columns’
level – Used with MultiIndex.
as_index – sql style grouped output.
sort – Default to True. Specify whether to sort after the group
group_keys – add group keys or not
squeeze – deprecated in new versions
observed – This only applies if any of the groupers are Categoricals.
dropna – Default to False. Use True to drop None/Nan on sorry keys

In [209]:
import pandas as pd
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print("Create DataFrame:\n", df)

Create DataFrame:
    Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [211]:
df2 =df.groupby('Courses').sum()
df2

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [214]:
df.groupby(['Courses','Duration']).sum()

                    Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days    24000    1200.0
        50days    22000    1600.0
Spark   30days    47000    2400.0

In [212]:
# Add Row Index to the group by result
df2 = df.groupby(['Courses','Duration']).sum().reset_index()
print("After adding index to DataFrame:\n", df2)

After adding index to DataFrame:
    Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

In [213]:
df2

   Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

In [215]:
# Drop rows that have None/Nan on group keys
df2=df.groupby(by=['Courses'], dropna=False).sum()
print(df2)

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [216]:
# Remove sorting on grouped results
df2=df.groupby(by=['Courses'], sort=False).sum()
print(df2)

           Fee  Discount
Courses
Spark    47000    2400.0
PySpark  25000    2300.0
Hadoop   48000    1000.0
Python   46000    2800.0
Pandas   26000    2500.0
NA        1500       0.0

In [217]:
# Sorting group keys on descending order
groupedDF = df.groupby('Courses',sort=False).sum()
sortedDF=groupedDF.sort_values('Courses', ascending=False)
print(sortedDF)

           Fee  Discount
Courses
Spark    47000    2400.0
Python   46000    2800.0
PySpark  25000    2300.0
Pandas   26000    2500.0
NA        1500       0.0
Hadoop   48000    1000.0

In [218]:
# Using apply() & lambda
df.groupby('Courses').apply(lambda x: x.sort_values('Fee'))

           Courses    Fee Duration  Discount
Courses
Hadoop  2   Hadoop  23000   55days    1000.0
        5   Hadoop  25000   35days       NaN
NA      8       NA   1500   40days       0.0
Pandas  4   Pandas  26000   60days    2500.0
PySpark 1  PySpark  25000   50days    2300.0
Python  7   Python  22000   50days    1600.0
        3   Python  24000   40days    1200.0
Spark   0    Spark  22000   30days    1000.0
        6    Spark  25000   30days    1400.0

In [219]:
# Groupby & multiple aggregations
result = df.groupby('Courses')['Fee'].aggregate(['min','max'])
print("After applying multiple aggregations on grouped data:\n", result)

After applying multiple aggregations on grouped data:
            min    max
Courses
Hadoop   23000  25000
NA        1500   1500
Pandas   26000  26000
PySpark  25000  25000
Python   22000  24000
Spark    22000  25000

In [220]:
# Groupby multiple columns & multiple aggregations
result = df.groupby('Courses').aggregate({'Duration':'count','Fee':['min','max']})
print("After applying multiple aggregations on grouped data:\n", result)

After applying multiple aggregations on grouped data:
         Duration    Fee
           count    min    max
Courses
Hadoop         2  23000  25000
NA             1   1500   1500
Pandas         1  26000  26000
PySpark        1  25000  25000
Python         2  22000  24000
Spark          2  22000  25000

In [222]:
# Quick Examples of Getting Column Names
# Below are some quick examples

# Example 1: Get the list of all column names from headers
column_names = list(df.columns.values)

# Example 2: Get the list of all column names from headers
column_names = df.columns.values.tolist()

# Example 3: Using list(df) to get the column headers as a list
column_names = list(df.columns)

# Example 4: Using list(df) to get the list of all Column Names
column_names = list(df)

# Example 5: Dataframe show all columns sorted list
column_names=sorted(df)

# Example 6: Get all Column Header Labels as List
for column_headers in df.columns: 
    print(column_headers)
    
column_names = df.keys().values.tolist()
print(column_names)

# Example 7: Get all numeric columns
numeric_columns = df._get_numeric_data().columns.values.tolist()
print(numeric_columns)

# Example 8: Simple Pandas Numeric Columns Code
numeric_columns=df.dtypes[df.dtypes == "int64"].index.values.tolist()
print(numeric_columns)

Courses
Fee
Duration
Discount
['Courses', 'Fee', 'Duration', 'Discount']
['Fee', 'Discount']
['Fee']

# By using pandas.DataFrame.sample() method you can shuffle the DataFrame rows randomly, if you are using the NumPy module you can use the permutation() method to change the order of the rows also called the shuffle. Python also has other packages like sklearn that has a method shuffle() to shuffle the order of rows in DataFrame.

In [223]:
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [224]:
# Shuffle the DataFrame rows & return all rows
df1 = df.sample(frac = 1)
print(df1)

   Courses    Fee Duration  Discount
5   Hadoop  25000   35days       NaN
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
3   Python  24000   40days    1200.0
7   Python  22000   50days    1600.0
2   Hadoop  23000   55days    1000.0
4   Pandas  26000   60days    2500.0
6    Spark  25000   30days    1400.0
8       NA   1500   40days       0.0

In [225]:
# Create a new Index starting from zero
df1 = df.sample(frac = 1).reset_index()
print(df1)

   index  Courses    Fee Duration  Discount
0      3   Python  24000   40days    1200.0
1      6    Spark  25000   30days    1400.0
2      1  PySpark  25000   50days    2300.0
3      5   Hadoop  25000   35days       NaN
4      4   Pandas  26000   60days    2500.0
5      8       NA   1500   40days       0.0
6      7   Python  22000   50days    1600.0
7      0    Spark  22000   30days    1000.0
8      2   Hadoop  23000   55days    1000.0

In [226]:
# Drop shuffle Index
df1 = df.sample(frac = 1).reset_index(drop=True)
print(df1)

   Courses    Fee Duration  Discount
0   Pandas  26000   60days    2500.0
1   Python  22000   50days    1600.0
2  PySpark  25000   50days    2300.0
3    Spark  25000   30days    1400.0
4       NA   1500   40days       0.0
5   Hadoop  23000   55days    1000.0
6    Spark  22000   30days    1000.0
7   Hadoop  25000   35days       NaN
8   Python  24000   40days    1200.0

Using numpy.random.shuffle to Change Order of Rows
You can use numpy.random.shuffle() to change the order of the DataFrame rows. Make sure you import NumPy before using this method.


# Using NumPy
import numpy as np
np.random.shuffle(DataFrame.values)

In [227]:
# Using numpy permutation() method to shuffle DataFrame rows
df1 = df.iloc[np.random.permutation(df.index)].reset_index(drop=True)
print(df1)

   Courses    Fee Duration  Discount
0   Python  22000   50days    1600.0
1   Hadoop  25000   35days       NaN
2   Hadoop  23000   55days    1000.0
3   Pandas  26000   60days    2500.0
4   Python  24000   40days    1200.0
5    Spark  22000   30days    1000.0
6       NA   1500   40days       0.0
7    Spark  25000   30days    1400.0
8  PySpark  25000   50days    2300.0

In [228]:
# Using sklearn to shuffle rows
from sklearn.utils import shuffle
df = shuffle(df)

In [229]:
df

   Courses    Fee Duration  Discount
3   Python  24000   40days    1200.0
2   Hadoop  23000   55days    1000.0
4   Pandas  26000   60days    2500.0
8       NA   1500   40days       0.0
6    Spark  25000   30days    1400.0
5   Hadoop  25000   35days       NaN
1  PySpark  25000   50days    2300.0
7   Python  22000   50days    1600.0
0    Spark  22000   30days    1000.0

In [230]:
# Using apply() method to shuffle the DataFrame rows
import numpy as np
df1 = df.apply(np.random.permutation, axis=1)    
print(df1)

3     [40days, 24000, Python, 1200.0]
2     [23000, 55days, Hadoop, 1000.0]
4     [2500.0, 26000, 60days, Pandas]
8             [40days, 1500, NA, 0.0]
6      [1400.0, Spark, 25000, 30days]
5        [35days, Hadoop, nan, 25000]
1    [PySpark, 2300.0, 25000, 50days]
7     [Python, 22000, 50days, 1600.0]
0      [30days, Spark, 1000.0, 22000]
dtype: object

In [231]:
# Using lambda method to Shuffle/permutating DataFrame rows
df2 = df.apply(lambda x: x.sample(frac=1).values)
print(df2)

   Courses    Fee Duration  Discount
3  PySpark  25000   60days    1000.0
2   Hadoop  25000   50days    2500.0
4       NA  22000   30days       NaN
8   Pandas  24000   40days    1200.0
6   Hadoop  23000   40days    1400.0
5    Spark   1500   50days       0.0
1   Python  26000   35days    2300.0
7    Spark  25000   55days    1000.0
0   Python  22000   30days    1600.0

In [232]:
# Using sample() method to shuffle DataFrame rows and columns
df2 = df.sample(frac=1, axis=1).sample(frac=1).reset_index(drop=True)
print(df2)

  Duration    Fee  Courses  Discount
0   50days  22000   Python    1600.0
1   40days   1500       NA       0.0
2   40days  24000   Python    1200.0
3   35days  25000   Hadoop       NaN
4   30days  22000    Spark    1000.0
5   60days  26000   Pandas    2500.0
6   55days  23000   Hadoop    1000.0
7   30days  25000    Spark    1400.0
8   50days  25000  PySpark    2300.0

Pandas join() is similar to SQL join where it combines columns from multiple DataFrames based on row indices. In pandas join can be done only on indexes but not on columns. By default, it uses the left join on the row index. If you want to join on columns you should use pandas.merge() method as this by default performs on columns


You can join pandas Dataframes similar to joining tables in SQL.
pandas.DataFrame.join() method is used to join DataFrames.
By default, it uses the left join on the row index. This is unlike merge() where it does inner join on common columns.
pandas also support other methods like concat() and merge() to join DataFrames.
Joining can be performed using the pd.merge() function or DataFrame methods like df.join().
Careful consideration of the join type and key columns is crucial to avoid unintended data duplication or loss during the joining process.


# Syntax of pandas.DataFrame.join() method
DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
other – Pass the right DataFrame object or list of DataFrame objects.
on – Specify which index you want to join on when you have multiple indexes.
how – Use to specify the join type. Accepts inner, left, right, outer.
lsuffix – Specify the left suffix string to column names
rsuffix – Specify the right suffix string to column names
sort – To specify the results to be sorted.

In [270]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)
print("First DataFrame:\n", df1)
technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)
print("Second DataFRame:\n", df2)

First DataFrame:
     Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Python  22000   35days
r4   pandas  30000   50days
Second DataFRame:
    Courses  Discount
r1   Spark      2000
r6    Java      2300
r3  Python      1200
r5      Go      2000

In [235]:
# Pandas join 
df3=df1.join(df2, lsuffix="_left", rsuffix="_right") # left join
print("After joining two DataFrames:\n", df3)

After joining two DataFrames:
    Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark    2000.0
r2      PySpark  25000   40days           NaN       NaN
r3       Python  22000   35days        Python    1200.0
r4       pandas  30000   50days           NaN       NaN

In [236]:
# Pandas Inner join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='inner')
print(df3)

   Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark      2000
r3       Python  22000   35days        Python      1200

In [237]:
# Pandas Right join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='right')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark      2000
r6          NaN      NaN      NaN          Java      2300
r3       Python  22000.0   35days        Python      1200
r5          NaN      NaN      NaN            Go      2000

In [238]:
# Also called Full Outer Join – Returns all rows from both DataFrames. 
# Where join expression doesn’t match it returns null on respective cells.


# Pandas outer join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='outer')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark    2000.0
r2      PySpark  25000.0   40days           NaN       NaN
r3       Python  22000.0   35days        Python    1200.0
r4       pandas  30000.0   50days           NaN       NaN
r5          NaN      NaN      NaN            Go    2000.0
r6          NaN      NaN      NaN          Java    2300.0

In [239]:
# Pandas join on columns
df3=df1.set_index('Courses').join(df2.set_index('Courses'), how='inner')
print(df3)

           Fee Duration  Discount
Courses
Spark    20000   30days      2000
Python   22000   35days      1200

In [240]:
# Pandas join
df3=df1.join(df2.set_index('Courses'), how='inner', on='Courses')
print(df3)

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      2000
r3  Python  22000   35days      1200

pandas support pandas.merge() and DataFrame.merge() to merge DataFrames which is exactly similar to SQL join and supports different types of join inner, left, right, outer, cross. By default, it uses inner join where keys don’t match the rows get dropped from both DataFrames, and the result DataFrame contains rows that match on both.


# Pandas.merge() Syntax
pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

In [ ]:
# Quick Examples of Merging pandas DataFrames

# Example 1: Pandas.merge()
df3=pd.merge(df1,df2)

# Example 2: DataFrame.merge()
df3=df1.merge(df2)

# Example 3: Merge by column
df3=pd.merge(df1,df2, on='Courses')

# Example 4: Merge on different colunn names
df3=pd.merge(df1,df2, left_on='Courses', right_on='Courses')

# Example 5: Merge by Index
df3 = pd.merge(df1,df2,left_index=True,right_index=True)

# Example 6: Merge by multiple columns
df3 = pd.merge(df3, df1,  how='left', left_on=['Col1','col2'], right_on = ['col1','col2'])

# Example 7: Merge by left join
df3=pd.merge(df1,df2, on='Courses', how='left')

# Example 8: Merge by right join
df3=pd.merge(df1,df2, on='Courses', how='right')

# Example 9: Merge by outer join
df3=pd.merge(df1,df2, on='Courses', how='outer')

In [241]:
# Example 1: Pandas.merge()
df3=pd.merge(df1,df2)

In [242]:
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [243]:
# Example 4: Merge on different colunn names
df3=pd.merge(df1,df2, left_on='Courses', right_on='Courses')
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [256]:
# Example 5: Merge by Index
df3 = pd.merge(df1,df2,left_index=True,right_index=True)
df3

   Courses_x    Fee Duration Courses_y  Discount
r1     Spark  20000   30days     Spark      2000
r3    Python  22000   35days    Python      1200

In [252]:
df1, df2

(    Courses    Fee Duration
 r1    Spark  20000   30days
 r2  PySpark  25000   40days
 r3   Python  22000   35days
 r4   pandas  30000   50days,
    Courses  Discount
 r1   Spark      2000
 r6    Java      2300
 r3  Python      1200
 r5      Go      2000)

In [257]:
# When column names are different
df3=pd.merge(df1,df2, left_on='Courses', right_on='Courses')
print(df3)

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [258]:
df3 = pd.merge(df3, df1,  how='left', left_on=['Courses','Fee'], right_on = ['Courses','Fee'])
print(df3)

  Courses    Fee Duration_x  Discount Duration_y
0   Spark  20000     30days      2000     30days
1  Python  22000     35days      1200     35days

Use pandas.concat() to concatenate/merge two or multiple pandas DataFrames across rows or columns. When you concat() two pandas DataFrames on rows, it creates a new Dataframe containing all rows of two DataFrames basically it does append one DataFrame with another. When you use concat() on columns it performs the join operation.

pandas concat() Key Points

By default concat() method performs an append operation meaning, it appends each DataFrame at the end of another DataFrame and creates a single DataFrame
When you use concat() to join two DataFrames, it supports only inner and outer joins, and by default, it performs outer join.
Using concat you can join or append multiple pandas DataFrames

# Syntax of concat() function
pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)

In [260]:
df, df1

(   Courses    Fee Duration  Discount
 3   Python  24000   40days    1200.0
 2   Hadoop  23000   55days    1000.0
 4   Pandas  26000   60days    2500.0
 8       NA   1500   40days       0.0
 6    Spark  25000   30days    1400.0
 5   Hadoop  25000   35days       NaN
 1  PySpark  25000   50days    2300.0
 7   Python  22000   50days    1600.0
 0    Spark  22000   30days    1000.0,
     Courses    Fee Duration
 r1    Spark  20000   30days
 r2  PySpark  25000   40days
 r3   Python  22000   35days
 r4   pandas  30000   50days)

In [ ]:
# Below are some quick examples

# Using pandas.concat() to concat two DataFrame
data = [df, df1]
df2 = pd.concat(data)

# Use pandas.concat() method to ignore_index 
df2 = pd.concat([df, df1], ignore_index=True, sort=False)

# Using pandas.concat() Method
data = [df, df1]
df2 = pd.concat(data, ignore_index=True, sort=False)

# Using pandas.concat() to join concat two DataFrames
data = pd.concat([df, df1], axis=1, join='inner')

# Using DataFrame.append() method
data = df.append(df1)

# Use DataFrame.append() 
df2 = df.append(df1, ignore_index=True)

# Appending multiple DataFrame
data = df.append([df1, df2])

In [259]:
# Use pandas.concat() method to ignore_index 
df2 = pd.concat([df, df1], ignore_index=True, sort=False)
df2

    Courses    Fee Duration  Discount
0    Python  24000   40days    1200.0
1    Hadoop  23000   55days    1000.0
2    Pandas  26000   60days    2500.0
3        NA   1500   40days       0.0
4     Spark  25000   30days    1400.0
5    Hadoop  25000   35days       NaN
6   PySpark  25000   50days    2300.0
7    Python  22000   50days    1600.0
8     Spark  22000   30days    1000.0
9     Spark  20000   30days       NaN
10  PySpark  25000   40days       NaN
11   Python  22000   35days       NaN
12   pandas  30000   50days       NaN

In [261]:
# Using pandas.concat() to join concat two DataFrames
data = pd.concat([df, df1], axis=1, join='inner')
data

Empty DataFrame
Columns: [Courses, Fee, Duration, Discount, Courses, Fee, Duration]
Index: []

In [262]:
# Appending multiple DataFrame
data = df.append([df1, df2])

C:\Users\A200160861\AppData\Local\Temp\ipykernel_20252\235149634.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = df.append([df1, df2])

In [263]:
data

    Courses    Fee Duration  Discount
3    Python  24000   40days    1200.0
2    Hadoop  23000   55days    1000.0
4    Pandas  26000   60days    2500.0
8        NA   1500   40days       0.0
6     Spark  25000   30days    1400.0
5    Hadoop  25000   35days       NaN
1   PySpark  25000   50days    2300.0
7    Python  22000   50days    1600.0
0     Spark  22000   30days    1000.0
r1    Spark  20000   30days       NaN
r2  PySpark  25000   40days       NaN
r3   Python  22000   35days       NaN
r4   pandas  30000   50days       NaN
0    Python  24000   40days    1200.0
1    Hadoop  23000   55days    1000.0
2    Pandas  26000   60days    2500.0
3        NA   1500   40days       0.0
4     Spark  25000   30days    1400.0
5    Hadoop  25000   35days       NaN
6   PySpark  25000   50days    2300.0
7    Python  22000   50days    1600.0
8     Spark  22000   30days    1000.0
9     Spark  20000   30days       NaN
10  PySpark  25000   40days       NaN
11   Python  22000   35days       NaN
12   pandas  30000   50days       NaN

pandas.DataFrame.fillna() method is used to fill column (one or multiple columns) containing NA/NaN/None with 0, empty, blank, or any specified values etc. NaN is considered a missing value. When you dealing with machine learning, handling missing values is very important, not handling these will result in a side effect with an incorrect result.

In [ ]:
# Below are quick examples.

# Example 1: Fillna() on all columns
df2=df.fillna('None')

# Example 2: Fillna() on once column
df2['Discount'] =  df['Discount'].fillna(0)

# Example 3: Fillna() on multiple columns
df2[['Discount','Fee']] =  df[['Discount','Fee']].fillna(0)

# Example 4: Fillna() on multiple columns with different values
df2 =  df.fillna(value={'Discount':0,'Fee':10000})

# Example 5: Fill with limit
df2=df.fillna(value={'Discount':0,'Fee':0},limit=1)

In [265]:
df

   Courses    Fee Duration  Discount
3   Python  24000   40days    1200.0
2   Hadoop  23000   55days    1000.0
4   Pandas  26000   60days    2500.0
8       NA   1500   40days       0.0
6    Spark  25000   30days    1400.0
5   Hadoop  25000   35days       NaN
1  PySpark  25000   50days    2300.0
7   Python  22000   50days    1600.0
0    Spark  22000   30days    1000.0

In [264]:
# Example 5: Fill with limit
df2=df.fillna(value={'Discount':0,'Fee':0},limit=1)
df2

   Courses    Fee Duration  Discount
3   Python  24000   40days    1200.0
2   Hadoop  23000   55days    1000.0
4   Pandas  26000   60days    2500.0
8       NA   1500   40days       0.0
6    Spark  25000   30days    1400.0
5   Hadoop  25000   35days       0.0
1  PySpark  25000   50days    2300.0
7   Python  22000   50days    1600.0
0    Spark  22000   30days    1000.0

In [ ]:
# Below are the quick examples

# Drop rows that has all Nan Values
df=df.dropna(how='all')

# Drop columns that has all Nan Values
df=df.dropna(how='all',axis=1)

# Default drop rows that contains nan values
df2=df.dropna()

# Drop all columns with NaN values
df2=df.dropna(axis=1)

# Drop rows that has NaN values on selected columns
df2=df.dropna(subset=['Courses','Duration'])

# With threshold, 
# Keep only the rows with at least 2 non-NA values.
df2=df.dropna(thresh=3,axis=1)

In [276]:
# Create DataFrame
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    '':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [277]:
df.dropna(how='all') ## Drop rows that has all Nan Value

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN

In [278]:
df.dropna(how='all',axis=1)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT
        NaN      NaN      NaN      NaN

In [282]:
dat = df 
dat

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [286]:
df

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [284]:
dat= dat.dropna()
dat

Empty DataFrame
Columns: [Courses, Fee, Duration, Discount, ]
Index: []

In [289]:
# Drop rows that has NaN values on selected columns
df2=df.dropna(subset=['Courses','Duration'])
print(df2)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN

In [290]:
# Keep only the rows with at least 2 non-NA values.
df2=df.dropna(thresh=2)
df2

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN

#pandas.DataFrame.sort_values()

# Syntax of DataFrame.sort_values()
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)
by – Accepts column/row name as list or list of names to sort.
axis – Axis to be sorted,default set to 0. 0 or ‘index’ & 1 or ‘columns’
ascending – bool or list of bool. Specify to do sort by ascending or descending order. Default ascending.
inplace – If True, updates existing DataFrame. Default set to False.
kind – Sorting alorithm to choose from {‘quicksort’, ‘mergesort’, ‘heapsort’, ‘stable’}, default ‘quicksort’
na_position – Specify where to keep the NaN’s. {‘first’, ‘last’}, Default set to ‘last’.
ignore_index – Specify to reset the index starting from zero. Default set to false.
key – callable, optional

It supports and provides a param to choose from ‘quicksort’, ‘mergesort’ and ‘heapsort’ algorithms.
By default performs ascending order.
All NaN values are pushed towards end on sorted column. Provides a way to show it at top.
You can reset the index on sorted result.

In [292]:
technologies = ({
    'Courses':["Spark",np.nan,"pandas","Java","Spark"],
    'Fee' :[20000,25000,30000,22000,26000],
    'Duration':['30days','40days','35days','60days','50days'],
    'Discount':[1000,2500,1500,1200,3000]
               })
df = pd.DataFrame(technologies, index = ['r1','r3','r5','r2','r4'])
print(df)

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3     NaN  25000   40days      2500
r5  pandas  30000   35days      1500
r2    Java  22000   60days      1200
r4   Spark  26000   50days      3000

In [293]:
df.sort_values('Courses')

   Courses    Fee Duration  Discount
r2    Java  22000   60days      1200
r1   Spark  20000   30days      1000
r4   Spark  26000   50days      3000
r5  pandas  30000   35days      1500
r3     NaN  25000   40days      2500

In [294]:
df.sort_values('Courses', ascending=False)

   Courses    Fee Duration  Discount
r5  pandas  30000   35days      1500
r1   Spark  20000   30days      1000
r4   Spark  26000   50days      3000
r2    Java  22000   60days      1200
r3     NaN  25000   40days      2500

In [295]:
# Sory by multiple columns
df2 = df.sort_values(by=['Courses','Fee'])
print(df2)

   Courses    Fee Duration  Discount
r2    Java  22000   60days      1200
r1   Spark  20000   30days      1000
r4   Spark  26000   50days      3000
r5  pandas  30000   35days      1500
r3     NaN  25000   40days      2500

In [296]:
# Sory by putting NaN at first
df2 = df.sort_values(by=['Courses','Fee'], na_position='first')
print(df2)

   Courses    Fee Duration  Discount
r3     NaN  25000   40days      2500
r2    Java  22000   60days      1200
r1   Spark  20000   30days      1000
r4   Spark  26000   50days      3000
r5  pandas  30000   35days      1500

 Syntax of sort_index() function
DataFrame.sort_index(axis=0, level=None, ascending=True, inplace=False, kind='quicksort', na_position='last', sort_remaining=True, ignore_index=False, key=None)

In [297]:
technologies = ({
    'Courses':["Spark",np.nan,"pandas","Java","Spark"],
    'Fee' :[20000,25000,30000,22000,26000],
    'Duration':['30days','40days','35days','60days','50days'],
    'Discount':[1000,2500,1500,1200,3000]
               })
df = pd.DataFrame(technologies, index = [101,123,115,340,100])
print(df)

    Courses    Fee Duration  Discount
101   Spark  20000   30days      1000
123     NaN  25000   40days      2500
115  pandas  30000   35days      1500
340    Java  22000   60days      1200
100   Spark  26000   50days      3000

In [298]:
df.sort_index()

    Courses    Fee Duration  Discount
100   Spark  26000   50days      3000
101   Spark  20000   30days      1000
115  pandas  30000   35days      1500
123     NaN  25000   40days      2500
340    Java  22000   60days      1200

In [299]:
df.sort_index(ignore_index=True)

  Courses    Fee Duration  Discount
0   Spark  26000   50days      3000
1   Spark  20000   30days      1000
2  pandas  30000   35days      1500
3     NaN  25000   40days      2500
4    Java  22000   60days      1200

In [300]:
# Sort by column names
df2 = df.sort_index(axis=1)
print(df2)

    Courses  Discount Duration    Fee
101   Spark      1000   30days  20000
123     NaN      2500   40days  25000
115  pandas      1500   35days  30000
340    Java      1200   60days  22000
100   Spark      3000   50days  26000

PANDAS RENAME SCENARIO	RENAME COLUMN EXAMPLE
Rename columns with list	df.columns=[‘A’,’B’,’C’]
Rename column name by index	df.columns.values[2] = “C”
Rename the column using Dict	df2=df.rename(columns={‘a’: ‘A’, ‘b’: ‘B’})
Rename column using Dict & axis	df2=df.rename({‘a’: ‘A’, ‘b’: ‘B’}, axis=1)
Rename column in place	df2=df.rename({‘a’: ‘A’, ‘b’: ‘B’}, axis=’columns’)
df.rename(columns={‘a’: ‘A’, ‘b’: ‘B’}, in place = True)	df.rename(columns={‘a’: ‘A’, ‘b’: ‘B’}, inplace = True)
Rename using lambda function	df.rename(columns=lambda x: x[1:], inplace=True)
Rename with error	df.rename(columns = {‘x’:’X’}, errors = “raise”)
Rename using set_asis()	df2=df.set_axis([‘A’,’B’,’C’], axis=1)

In [48]:
a=np.array([-1,1])
b=np.array([1,1])
np.dot(a,b)

0

In [49]:
X=np.array([[1,0],[0,1]])
Y=np.array([[2,2],[2,2]])
Z=np.dot(X,Y)

In [50]:
Z

array([[2, 2],
       [2, 2]])

In [52]:
a=np.array([0,1,0,1,0])
b=np.array([1,0,1,0,1]) 
a*b

array([0, 0, 0, 0, 0])

In [ ]:
Reading and writing files
Package/Method	Description	Syntax and Code Example
File opening modes	Different modes to open files for specific operations.	Syntax: r (reading) w (writing) a (appending) + (updating: read/write) b (binary, otherwise text)
1
Examples: with open("data.txt", "r") as file: content = file.read() print(content) with open("output.txt", "w") as file: file.write("Hello, world!") with open("log.txt", "a") as file: file.write("Log entry: Something happened.") with open("data.txt", "r+") as file: content = file.read() file.write("Updated content: " + content)</td>
Copied!
File reading methods	Different methods to read file content in various ways.	Syntax:
1
2
3
file.readlines() # reads all lines as a list
readline() # reads the next line as a string
file.read() # reads the entire file content as a string
Copied!
Example:

1
2
3
4
with open("data.txt", "r") as file:
    lines = file.readlines()
    next_line = file.readline()
    content = file.read()
Copied!
File writing methods	Different write methods to write content to a file.	Syntax:
1
2
file.write(content) # writes a string to the file
file.writelines(lines) # writes a list of strings to the file
Copied!
Example:

1
2
3
lines = ["Hello\n", "World\n"]
with open("output.txt", "w") as file:
    file.writelines(lines)
Copied!
Iterating over lines	Iterates through each line in the file using a `loop`.	Syntax:
1
for line in file: # Code to process each line
Copied!
Example:

1
2
with open("data.txt", "r") as file:
for line in file: print(line)
Copied!
Open() and close()	Opens a file, performs operations, and explicitly closes the file using the close() method.	Syntax:
1
2
file = open(filename, mode) # Code that uses the file
file.close()
Copied!
Example:

1
2
3
file = open("data.txt", "r")
content = file.read()
file.close()
Copied!
with open()	Opens a file using a with block, ensuring automatic file closure after usage.	Syntax:
1
with open(filename, mode) as file: # Code that uses the file
Copied!
Example:

1
2
with open("data.txt", "r") as file:
content = file.read()
Copied!
Pandas
Package/Method	Description	Syntax and Code Example
.read_csv()	Reads data from a `.CSV` file and creates a DataFrame.	Syntax: dataframe_name = pd.read_csv("filename.csv") Example: df = pd.read_csv("data.csv")
.read_excel()	Reads data from an Excel file and creates a DataFrame.	Syntax:
1
dataframe_name = pd.read_excel("filename.xlsx")
Copied!
Example:

1
df = pd.read_excel("data.xlsx")
Copied!
.to_csv()	Writes DataFrame to a CSV file.	Syntax:
1
dataframe_name.to_csv("output.csv", index=False)
Copied!
Example:

1
df.to_csv("output.csv", index=False)
Copied!
Access Columns	Accesses a specific column using [] in the DataFrame.	Syntax:
1
2
dataframe_name["column_name"] # Accesses single column
dataframe_name[["column1", "column2"]] # Accesses multiple columns
Copied!
Example:

1
2
df["age"]
df[["name", "age"]]
Copied!
describe()	Generates statistics summary of numeric columns in the DataFrame.	Syntax:
1
dataframe_name.describe()
Copied!
Example:

1
df.describe()
Copied!
drop()	Removes specified rows or columns from the DataFrame. axis=1 indicates columns. axis=0 indicates rows.	Syntax:
1
2
dataframe_name.drop(["column1", "column2"], axis=1, inplace=True)
dataframe_name.drop(index=[row1, row2], axis=0, inplace=True)
Copied!
Example:

1
2
df.drop(["age", "salary"], axis=1, inplace=True) # Will drop columns
df.drop(index=[5, 10], axis=0, inplace=True) # Will drop rows
Copied!
dropna()	Removes rows with missing NaN values from the DataFrame. axis=0 indicates rows.	Syntax:
1
dataframe_name.dropna(axis=0, inplace=True)
Copied!
Example:

1
df.dropna(axis=0, inplace=True)
Copied!
duplicated()	Duplicate or repetitive values or records within a data set.	Syntax:
1
dataframe_name.duplicated()
Copied!
Example:

1
duplicate_rows = df[df.duplicated()]
Copied!
Filter Rows	Creates a new DataFrame with rows that meet specified conditions.	Syntax:
1
filtered_df = dataframe_name[(Conditional_statements)]
Copied!
Example:

1
filtered_df = df[(df["age"] > 30) & (df["salary"] < 50000)
Copied!
groupby()	Splits a DataFrame into groups based on specified criteria, enabling subsequent aggregation, transformation, or analysis within each group.	Syntax:
1
2
grouped = dataframe_name.groupby(by, axis=0, level=None, as_index=True,
sort=True, group_keys=True, squeeze=False, observed=False, dropna=True)
Copied!
Example:

1
grouped = df.groupby(["category", "region"]).agg({"sales": "sum"})
Copied!
head()	Displays the first n rows of the DataFrame.	Syntax:
1
dataframe_name.head(n)
Copied!
Example:

1
df.head(5)
Copied!
Import pandas	Imports the Pandas library with the alias pd.	Syntax:
1
import pandas as pd
Copied!
Example:

1
import pandas as pd
Copied!
info()	Provides information about the DataFrame, including data types and memory usage.	Syntax:
1
dataframe_name.info()
Copied!
Example:

1
df.info()
Copied!
merge()	Merges two DataFrames based on multiple common columns.	Syntax:
1
merged_df = pd.merge(df1, df2, on=["column1", "column2"])
Copied!
Example:

1
merged_df = pd.merge(sales, products, on=["product_id", "category_id"])
Copied!
print DataFrame	Displays the content of the DataFrame.	Syntax:
1
print(df) # or just type df
Copied!
Example:

1
2
print(df)
df
Copied!
replace()	Replaces specific values in a column with new values.	Syntax:
1
dataframe_name["column_name"].replace(old_value, new_value, inplace=True)
Copied!
Example:

1
df["status"].replace("In Progress", "Active", inplace=True)
Copied!
tail()	Displays the last n rows of the DataFrame.	Syntax:
1
dataframe_name.tail(n)
Copied!
Example:

1
df.tail(5)
Copied!
Numpy
Package/Method	Description	Syntax and Code Example
Importing NumPy	Imports the NumPy library.	Syntax:
1
import numpy as np
Copied!
Example:

1
import numpy as np
Copied!
np.array()	Creates a one or multi-dimensional array,	Syntax:
1
2
array_1d = np.array([list1 values]) # 1D Array
array_2d = np.array([[list1 values], [list2 values]]) # 2D Array
Copied!
Example:

1
2
array_1d = np.array([1, 2, 3]) # 1D Array
array_2d = np.array([[1, 2], [3, 4]]) # 2D Array
Copied!
Numpy Array Attributes	- Calculates the mean of array elements
- Calculates the sum of array elements
- Finds the minimum value in the array
- Finds the maximum value in the array
- Computes dot product of two arrays	Example:
1
2
3
4
5
np.mean(array)
np.sum(array)
np.min(array
np.max(array)
np.dot(array_1, array_2)
Copied!

In [ ]:
# Exercise

In [301]:
data = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [302]:
import pandas as pd

In [305]:
df = pd.DataFrame(data)
df.head(5)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [307]:
# Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [309]:
df2 = pd.DataFrame(exam_data, index = labels)
df2.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [314]:
df2[df2['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [315]:
# No of cols, rows
len(df)

5

In [317]:
row_count = df.shape[0]  # Returns number of rows
col_count = df.shape[1]  # Returns number of columns
print(row_count, col_count)

5 3

In [324]:
df2[df2['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [326]:
df2[df2['score']>=15]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [327]:
df2[df2['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [332]:
df2[(df2['score']>15) & (df2['attempts']<2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [330]:
df2[(df2['attempts'] < 2) & (df2['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes